software/index.html
---
title: My Repository@Github
date: 2017-01-15 19:52:52
layout: default
lang: ja
ref: software
permalink: /software/index.html
---
<div id="outline-container-org3037321" class="outline-2">
<h2 id="org3037321">これは何?</h2>
<div class="outline-text-2" id="text-org3037321">
<p>
主に自分が使うために作成したソフトウェア、
ひきとったソフトウェア、
プレゼン用のテーマなどです.
公開できるモノについては github にどんどん置いています. パッチウェルカム.
</p>
</div>
</div>
<div id="outline-container-org0bd60c9" class="outline-2">
<h2 id="org0bd60c9"><a href="rdtool/index.html">RDtool: formatter for RD</a></h2>
<div class="outline-text-2" id="text-org0bd60c9">
<p>
RD は Ruby における POD(Plain Old Documentation) のようなものです.
RDtool は RD のフォーマッタであり, RD を HTML や roff などに変換できます.
以前は Moonwolf さんがリリースマネジメントをされていましたが,
2011年 5 月に引き継いで, gem 化したりイロイロ弄っています.
</p>
</div>
</div>
<div id="outline-container-orgb6ad633" class="outline-2">
<h2 id="orgb6ad633"><a href="rail/index.html">Rail: Replace Agent-string Internal Library</a></h2>
<div class="outline-text-2" id="text-orgb6ad633">
<p>
しまだみつひろさんが作成された rail を勝手に引き取って公開/気がついた時にアップデートしています.
お気付きの点がありましたら, ご連絡下さい.
</p>
</div>
</div>
<div id="outline-container-orgbf282ce" class="outline-2">
<h2 id="orgbf282ce"><a href="tdiary-style-org/index.html">TDiary::Style::Org</a></h2>
<div class="outline-text-2" id="text-orgbf282ce">
<p>
TDiary::Style::Org は
<a href="http://orgmode.org/">Org-mode</a> の syntax で
<a href="http://www.tdiary.org/">tDiary.org</a> の記事を書くためのスタイルを提供します．
</p>
</div>
</div>
<div id="outline-container-org1402738" class="outline-2">
<h2 id="org1402738"><a href="jekyll-org-converter/index.html">Jekyll Org Converter</a></h2>
<div class="outline-text-2" id="text-org1402738">
<p>
Jekyll の原稿として <a href="http://orgmode.org/">Org mode</a> で書かれたファイルを処理できるようにするプラグインです．
org ファイルの <code>+OPTIONS</code> を Jekyll の YAML Front Matter として扱える様にしてあります．
</p>
</div>
</div>
